---
kind: method
id: M:Autodesk.Revit.DB.ExportPatternTable.#ctor
source: html/4b91ad88-64ac-a836-e5ce-97723474f7ff.htm
---
# Autodesk.Revit.DB.ExportPatternTable.#ctor Method

Constructs a new ExportPatternTable with default values.

## Syntax (C#)
```csharp
public ExportPatternTable()
```